using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

using Xamarin.Forms;
using Xamarin.Forms.Xaml;

namespace FitBOOST
{
	[XamlCompilation(XamlCompilationOptions.Compile)]
	public partial class RulesPage : ContentPage
	{
		public RulesPage ()
		{
			InitializeComponent ();
            welcomeBackgroundImage.Source = ImageSource.FromResource("FitBOOST.welcomeBackground.png");
            welcomeBackgroundImage.Aspect = Aspect.AspectFill;
            ruleEditor.Text = "Условия использования:\r\n\r\n 1. При скачивании, установке и использовании мобильного приложения \"FitBoost\" вы соглашаетесь с настоящими условиями использования.\r\n 2. Приложение \"FitBoost\" предоставляет информацию и рекомендации по подбору тренажеров для спортивной подготовки, однако не несет ответственности за результаты использования такой информации.\r\n 3. Использование приложения \"FitBoost\" не заменяет консультацию со специалистом в области физической подготовки. Перед началом любой тренировки рекомендуется проконсультироваться с тренером или врачом.\r\n 4. Все предложенные тренировки и упражнения следует выполнять с учетом своих физических возможностей и соблюдать меры предосторожности, указанные в приложении.\r\n 5. Авторы и разработчики приложения \"FitBoost\" не несут ответственности за любые травмы, ущерб или потери, возникшие в результате использования приложения.\r\n\nПолитика конфиденциальности:\r\n\r\n 1. Приложение \"FitBoost\" собирает определенную персональную информацию, которая может включать в себя имя, электронную почту, возраст, пол и другую информацию, необходимую для оптимального подбора тренажеров.\r\n 2. Собранная персональная информация используется исключительно для внутренних целей, связанных с улучшением функциональности и предоставлением персонализированных рекомендаций в рамках приложения.\r\n 3. Персональная информация, собранная в приложении \"FitBoost\", не будет передаваться третьим лицам без вашего согласия, за исключением случаев, предусмотренных законодательством.\r\n 4. Мы предпринимаем все разумные меры для защиты вашей персональной информации от несанкционированного доступа, использования или раскрытия.\r\n 5. Приложение \"FitBoost\" может использовать файлы cookie и аналитические инструменты третьих сторон для сбора анонимной информации о использовании приложения с целью улучшения его функциональности и качества обслуживания.\r\n\n    Пожалуйста, ознакомьтесь с указанными условиями использования и политикой конфиденциальности перед использованием мобильного приложения \"FitBoost\". Если вы не согласны с данными условиями, прекратите использование приложения.";
        }

        
        protected override bool OnBackButtonPressed()
        {
            return true;
        }

        private async void goToBackButton_Clicked(object sender, EventArgs e)
        {
            await Navigation.PopModalAsync();
        }
    }
}